{
  "pageTitle": "Stepan | Technologie-Enthusiast & Entwickler | Wien",
  "navAbout": "Über mich",
  "navProjects": "Projekte",
  "navContact": "Kontakt",
  "langRU": "RU",
  "langEN": "EN",
  "langDE": "DE",
  "menuAriaLabel": "Menü öffnen",
  "heroIntro": "Hallo, ich bin Stepan 👋",
  "heroTitle": "Technologie-Enthusiast und Entwickler",
  "heroSubtitleBase": "Ich erstelle ",
  "heroTyped1": "Werkzeuge für die Arbeit mit KI.",
  "heroTyped2": "nützliche Bots für Communities.",
  "heroTyped3": "mobile Anwendungen.",
  "heroTyped4": "Automatisierungslösungen.",
  "heroTyped5": "Software in Python.",
  "heroBtnProjects": "Projekte ansehen",
  "heroBtnContact": "Kontaktieren",
  "aboutHeading": "Wer bin ich?",
  "aboutP1": "Hallo! Mein Name ist Stepan, ich bin ein Entwickler aus Wien. Mich inspiriert die Möglichkeit, Technologie zur Lösung realer Probleme und zur Schaffung von etwas Neuem und Nützlichem einzusetzen.",
  "aboutP2": "Mein Weg in die Welt des Codes begann mit dem Erlernen der fundamentalen Grundlagen der Python-Programmierung am Yandex Lyceum. Später sammelte ich wertvolle praktische Erfahrungen in der Entwicklung mobiler Anwendungen während meines Studiums an der Samsung IT School. Diese vielfältige Erfahrung schuf eine solide Grundlage und lehrte mich, Aufgaben aus verschiedenen Perspektiven anzugehen.",
  "aboutP3": "Ich wende mein Wissen gerne in der Praxis an, was zur Entwicklung von Projekten wie <a href=\"/neurabox/\">NeuraBox</a> (ein Werkzeug für die Arbeit mit lokaler KI), <a href=\"/firex-bot/\">FIREX BOT</a> (ein multifunktionaler Open-Source-Discord-Bot) und <a href=\"/my-time/\">My Time</a> (eine mobile Zeitmanagement-Anwendung) führte.",
  "aboutP4": "Obwohl meine Haupterfahrung in Bereichen im Zusammenhang mit Python und mobiler Entwicklung liegt, interessiere ich mich aktiv für neue Technologien und erlerne diese, einschließlich Webentwicklungswerkzeugen, die mir helfen, meine Projekte zum Leben zu erwecken und zu präsentieren (wie zum Beispiel diese Webseite!).",
  "skillsHeading": "Kernkompetenzen und Interessen:",
  "skillAndroid": "Android-Entwicklung (Grundlagen)",
  "skillAlgorithms": "Algorithmen & Datenstrukturen",
  "skillAutomation": "Automatisierung (Bots, Skripte)",
  "skillAIInterest": "Interesse an AI/ML",
  "skillWeb": "HTML & CSS (Lernend)",
  "skillJS": "JavaScript (Grundlagen)",
  "skillProblemSolving": "Problemlösung",
  "skillLearning": "Schnelle Auffassungsgabe",
  "projectsHeading": "Meine Arbeiten",
  "projectNeuraBoxDesc": "Ein Programm zum Ausführen lokaler neuronaler Netze mit umfangreicher Funktionalität.",
  "projectFirexBotDesc": "Open-Source Discord-Bot (Benachrichtigungen, Moderation, Level, Minispiele).",
  "projectMyTimeDesc": "Eine Zeitmanagement-Anwendung für Einzelunternehmer.",
  "projectLearnMore": "Mehr erfahren",
  "contactHeading": "Lassen Sie uns zusammenarbeiten!",
  "contactP1": "Offen für neue Projekte und interessante Angebote. Schreiben Sie mir!",
  "contactBtnEmail": "Email",
  "contactBtnGithub": "GitHub",
  "contactBtnLinkedin": "LinkedIn",
  "footerText": "Stepan. Gemacht mit <i class=\"ph-fill ph-heart\" style=\"color: var(--primary-color);\"></i> in Wien.",
  "projectNeuraBoxTitle": "Projekt NeuraBox | Stepans Portfolio",
  "projectBackLink": "Zurück zum Portfolio",
  "projectDescriptionHeading": "Beschreibung",
  "projectDescP1": "NeuraBox ist eine leistungsstarke und flexible KI-Assistentenanwendung, die für die Arbeit mit verschiedenen neuronalen Netzen konzipiert wurde und eine nahtlose Benutzererfahrung für die Generierung von Text, Bildern und Videos bietet. Die Anwendung verfügt über eine intuitive Benutzeroberfläche, Modellwechsel in Echtzeit und lokale Verarbeitungsmöglichkeiten ohne Abhängigkeit von externen Servern.",
  "projectDescP2": "NeuraBox richtet sich an KI-Enthusiasten, Forscher und Entwickler, die eine private und effiziente Möglichkeit zur Interaktion mit lokalen KI-Modellen suchen.",
  "projectFeaturesHeading": "Hauptmerkmale",
  "featureNeuraBox1": "Chat-System mit Tabs: Ermöglicht die Verwaltung mehrerer Gespräche mit verschiedenen Modellen.",
  "featureNeuraBox2": "Unterstützung mehrerer Modelle: Wählen Sie aus einer breiten Palette von KI-Modellen, die auf Hugging Face verfügbar sind.",
  "featureNeuraBox3": "Lokale Verarbeitung: Führen Sie KI-Modelle direkt auf Ihrem Computer ohne Cloud-Abhängigkeiten aus.",
  "featureNeuraBox4": "Dark-Mode-Oberfläche: Modernes und elegantes Design mit Fokus auf Benutzerfreundlichkeit.",
  "featureNeuraBox5": "Echtzeit-Chat: Interagieren Sie mit der KI über eine chatähnliche Oberfläche.",
  "featureNeuraBox6": "Aufgaben-Synchronisation: Verwalten Sie Aufgaben und behalten Sie den Überblick über frühere Interaktionen.",
  "featureNeuraBox7": "Erweiterte Anpassung: Feinabstimmung des Modellverhaltens und der Präferenzen.",
  "projectPlannedHeading": "Geplante Funktionen",
  "plannedNeuraBox1": "Unterstützung verschiedener KI-Modelle: Integration von Modellen, die auf Text-, Bild- und Videogenerierung spezialisiert sind.",
  "plannedNeuraBox2": "Text-Streaming: Reibungslose Echtzeit-Textgenerierung für eine bessere Benutzererfahrung.",
  "plannedNeuraBox3": "Internetzugang für KI-Modelle: Geplante Funktion, die es Modellen ermöglicht, Echtzeitdaten abzurufen, um die Antwortgenauigkeit zu verbessern.",
  "projectTechHeading": "Technologien",
  "projectTechP1": "Bei der Entwicklung von NeuraBox wurde folgender Technologie-Stack verwendet:",
  "projectTechBackend": "Backend & KI-Kern (Python):",
  "projectTechFrontend": "Frontend (JavaScript):",
  "projectTechTools": "Werkzeuge & Sonstiges:",
  "projectLinksHeading": "Links",
  "projectLinksRepo": "Repository auf GitHub",
  "projectLinksDemo": "Download / Demo: Release-Version bald verfügbar!",
  "projectMediaHeading": "Screenshots / Medien",
  "projectMediaP1": "Screenshots der Benutzeroberfläche und Demonstrationen werden später hinzugefügt.",
  "projectFooterLink": "Zurück zur Hauptseite",
  "projectMyTimeTitle": "Projekt My Time | Stepans Portfolio",
  "projectMyTimeSubtitle": "Android-App | Abschlussprojekt Samsung IT School (2022)",
  "projectDescMyTimeP1": "Willkommen bei My Time, Ihrem persönlichen Zeitmanagement-Assistenten. Diese Android-Anwendung, entwickelt als Abschlussprojekt an der Samsung IT School (2022), soll Ihnen helfen, Ihre Zeit in den Griff zu bekommen, insbesondere wenn Sie Freiberufler oder Selbstständiger sind.",
  "projectDescMyTimeP2": "Das Projekt konzentrierte sich auf die Schaffung eines benutzerfreundlichen Werkzeugs zur Organisation von Arbeitsabläufen und zur Steigerung der Produktivität.",
  "projectFeaturesMyTimeHeading": "Implementierte Funktionen",
  "featureMyTime1": "Aufgabenverwaltung: Einfaches Erstellen, Organisieren und Verwalten Ihrer Aufgaben und To-Do-Listen. Behalten Sie den Überblick über Ihre Arbeitslast und verpassen Sie keine Fristen.",
  "featureMyTime2": "Zeiterfassung: Verfolgen Sie, wie Sie Ihre Zeit für verschiedene Aufgaben und Projekte aufwenden, um Einblicke in Ihre Produktivität zu gewinnen.",
  "featureMyTime3": "Ereignis-/Eintragsverwaltung: Dem Screenshot nach zu urteilen, wurde die Möglichkeit implementiert, Ereignisse unter Angabe von Name, Preis (?), Ausrüstung (?), Datum/Uhrzeit und Benachrichtigungseinstellungen hinzuzufügen.",
  "projectTechMyTimeP1": "Die Anwendung wurde mit den folgenden Technologien entwickelt:",
  "projectTechPlatform": "Plattform & Sprache:",
  "projectTechUI": "UI & Komponenten:",
  "projectTechBuild": "Build & Testing:",
  "projectLinksMyTimeRepo": "Repository auf GitHub",
  "projectLinksMyTimeStatus": "Google Play Store: (Nicht veröffentlicht. Umfassende Überarbeitung vor Release geplant)",
  "projectMediaMyTimeHeading": "Screenshots",
  "altMyTimeScreenshot1": "Screenshot My Time 1",
  "altMyTimeScreenshot2": "Screenshot My Time 2",
  "altMyTimeScreenshot3": "Screenshot My Time 3",
  "projectFirexBotTitle": "Projekt FIREX BOT | Stepans Portfolio",
  "projectDescFirexBotP1": "FIREX BOT ist ein multifunktionaler Open-Source-Discord-Bot, der entwickelt wurde, um die Serververwaltung zu vereinfachen und interaktive Elemente für die Community hinzuzufügen. Ursprünglich für meinen persönlichen Server erstellt, wird der Bot nun für den globalen Einsatz vorbereitet.",
  "projectDescFirexBotP2": "Der Bot bietet eine Reihe von Werkzeugen, darunter Benachrichtigungen über den Start von Twitch-Streams, Moderationsbefehle, ein aktivitätsbasiertes Benutzerlevelsystem und unterhaltsame Minispiele.",
  "projectDescFirexBotP3": "Das Projekt ist Open-Source, was es anderen Benutzern ermöglicht, es einfach lokal bereitzustellen und an ihre Bedürfnisse anzupassen.",
  "projectFeaturesFirexBotHeading": "Hauptfunktionen",
  "featureFirexBot1": "Twitch-Benachrichtigungen: Benachrichtigt den Server, wenn angegebene Streamer live gehen.",
  "featureFirexBot2": "Moderation: Eine Reihe von Befehlen zur Aufrechterhaltung der Ordnung auf dem Server (z.B. kick, ban, mute).",
  "featureFirexBot3": "Level-System: Benutzer sammeln Erfahrung und steigen im Level auf, indem sie Nachrichten senden, was die Aktivität fördert.",
  "featureFirexBot4": "Minispiele: Eingebaute einfache Spiele zur Unterhaltung der Servermitglieder.",
  "featureFirexBot5": "Open Source: Ermöglicht es jedem, den Code zu studieren, Beiträge zu leisten oder eine eigene Version des Bots bereitzustellen.",
  "featureFirexBot6": "Lokale Bereitstellung: Konzipiert für die einfache Ausführung auf der eigenen Hardware des Benutzers.",
  "projectTechFirexBotP1": "Die Haupttechnologien, die in FIREX BOT verwendet werden:",
  "projectTechLangLibs": "Hauptsprache & Bibliotheken:",
  "projectTechToolsFirexBot": "Werkzeuge:",
  "projectLinksFirexBotRepo": "Repository auf GitHub",
  "projectLinksFirexBotStatus": "Globale Version / Einladung: Bald verfügbar!",
  "projectMediaFirexBotHeading": "Screenshots / Beispiele",
  "projectMediaFirexBotP1": "Beispiele für Befehle, Benachrichtigungen und Minispiel-Interaktionen werden später hinzugefügt.",
  "projectCommandsHeading": "Befehlsliste",
  "cmdDescAddBadWord": "Fügt schlechtes/schlechte Wort(e) zur Datenbank hinzu.",
  "cmdDescAddStreamer": "Fügt einen Streamer zur Datenbank für das Tracking hinzu.",
  "cmdDescBadWords": "Zeigt die Liste aller schlechten Wörter.",
  "cmdDescBan": "Verbannt ein Servermitglied.",
  "cmdDescClearAllWarns": "Entfernt alle Verwarnungen auf dem Server.",
  "cmdDescClearWarns": "Entfernt alle Verwarnungen eines bestimmten Benutzers.",
  "cmdDescDeleteMessage": "Löscht eine bestimmte Nachricht anhand der ID im ausgewählten Kanal.",
  "cmdDescKick": "Kickt einen Benutzer vom Server.",
  "cmdDescLeaderboard": "Zeigt die Bestenliste basierend auf Level und Nachrichtenanzahl.",
  "cmdDescMessagesCount": "Zeigt die Nachrichtenanzahl des Benutzers im Kanal.",
  "cmdDescMute": "Verhindert für einige Zeit, dass ein Benutzer im Server-Chat schreiben kann.",
  "cmdDescProfile": "Zeigt dein Level und die Anzahl der von dir geschriebenen Nachrichten.",
  "cmdDescRemoveBadWord": "Entfernt ein schlechtes Wort aus der Datenbank.",
  "cmdDescRemoveStreamer": "Entfernt einen Streamer aus der Tracking-Datenbank.",
  "cmdDescRps": "Spielt Schere-Stein-Papier mit dir.",
  "cmdDescUnban": "Entbannt einen Benutzer anhand der ID.",
  "cmdDescUnmute": "Gibt einem ausgewählten Mitglied die Möglichkeit zurück, im Chat zu schreiben.",
  "cmdDescWarn": "Erteilt einem Benutzer eine Verwarnung.",
  "cmdDescWarns": "Zeigt die Liste der Verwarnungen eines Benutzers."
}